flow-around-ractangular-cylinder/flow_around_cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       109450;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       109550;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       109650;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       110150;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          110000;
        startFace       110550;
    }
)

// ************************************************************************* //
